## Loading the inline SQL display

In [34]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Creating four tables below
- employee
- departments
- job titles
- salaries

In [35]:
%%sql
CREATE TABLE employees (
  employee_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  date_of_birth DATE,
  address VARCHAR(100),
  email_address VARCHAR(100),
  phone_number VARCHAR(20),
  department_id INT,
  job_title_id INT,
  FOREIGN KEY (department_id) REFERENCES departments(department_id),
  FOREIGN KEY (job_title_id) REFERENCES job_titles(job_title_id));

*  sqlite://
(sqlite3.OperationalError) table employees already exists
[SQL: CREATE TABLE employees (
  employee_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  date_of_birth DATE,
  address VARCHAR(100),
  email_address VARCHAR(100),
  phone_number VARCHAR(20),
  department_id INT,
  job_title_id INT,
  FOREIGN KEY (department_id) REFERENCES departments(department_id),
  FOREIGN KEY (job_title_id) REFERENCES job_titles(job_title_id));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [36]:
%%sql
CREATE TABLE departments (
  department_id INT PRIMARY KEY,
  department_name VARCHAR(50));

*  sqlite://
(sqlite3.OperationalError) table departments already exists
[SQL: CREATE TABLE departments (
  department_id INT PRIMARY KEY,
  department_name VARCHAR(50));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [37]:
%%sql
CREATE TABLE job_titles (
  job_title_id INT PRIMARY KEY,
  job_title VARCHAR(50));

*  sqlite://
(sqlite3.OperationalError) table job_titles already exists
[SQL: CREATE TABLE job_titles (
  job_title_id INT PRIMARY KEY,
  job_title VARCHAR(50));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [38]:
%%sql
CREATE TABLE salaries (
  salary_id INT PRIMARY KEY,
  employee_id INT,
  salary DECIMAL(10, 2),
  start_date DATE,
  end_date DATE,
  FOREIGN KEY (employee_id) REFERENCES employees (employee_id));

*  sqlite://
(sqlite3.OperationalError) table salaries already exists
[SQL: CREATE TABLE salaries (
  salary_id INT PRIMARY KEY,
  employee_id INT,
  salary DECIMAL(10, 2),
  start_date DATE,
  end_date DATE,
  FOREIGN KEY (employee_id) REFERENCES employees (employee_id));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Adding some sample data

In [39]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, date_of_birth, address, email_address, phone_number, department_id, job_title_id)
VALUES
  (1, 'Emily', 'Garcia', '1990-05-01', '123 Broadway, New York, NY 10001', 'emily.garcia@example.com', '555-1234', 1, 1),
  (2, 'Daniel', 'Nguyen', '1988-12-15', '456 Lexington Ave, New York, NY 10017', 'daniel.nguyen@example.com', '555-5678', 1, 2),
  (3, 'Brianna', 'Patel', '1985-03-25', '789 Madison Ave, New York, NY 10021', 'brianna.patel@example.com', '555-9012', 2, 3),
  (4, 'Aiden', 'Smith', '1993-07-07', '321 5th Ave, New York, NY 10016', 'aiden.smith@example.com', '555-3456', 2, 4),
  (5, 'Olivia', 'Brown', '1980-11-18', '654 8th Ave, New York, NY 10036', 'olivia.brown@example.com', '555-7890', 3, 5),
  (6, 'Ethan', 'Carter', '1995-06-30', '987 Park Ave, New York, NY 10028', 'ethan.carter@example.com', '555-2345', 4, 6),
  (7, 'Sophia', 'Clark', '1982-09-22', '654 2nd Ave, New York, NY 10016', 'sophia.clark@example.com', '555-6789', 5, 7),
  (8, 'Lucas', 'Lopez', '1987-04-12', '321 1st Ave, New York, NY 10003', 'lucas.lopez@example.com', '555-0123', 5, 8);

*  sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.employee_id
[SQL: INSERT INTO employees (employee_id, first_name, last_name, date_of_birth, address, email_address, phone_number, department_id, job_title_id)
VALUES
  (1, 'Emily', 'Garcia', '1990-05-01', '123 Broadway, New York, NY 10001', 'emily.garcia@example.com', '555-1234', 1, 1),
  (2, 'Daniel', 'Nguyen', '1988-12-15', '456 Lexington Ave, New York, NY 10017', 'daniel.nguyen@example.com', '555-5678', 1, 2),
  (3, 'Brianna', 'Patel', '1985-03-25', '789 Madison Ave, New York, NY 10021', 'brianna.patel@example.com', '555-9012', 2, 3),
  (4, 'Aiden', 'Smith', '1993-07-07', '321 5th Ave, New York, NY 10016', 'aiden.smith@example.com', '555-3456', 2, 4),
  (5, 'Olivia', 'Brown', '1980-11-18', '654 8th Ave, New York, NY 10036', 'olivia.brown@example.com', '555-7890', 3, 5),
  (6, 'Ethan', 'Carter', '1995-06-30', '987 Park Ave, New York, NY 10028', 'ethan.carter@example.com', '555-2345', 4, 6),
  (7, 'Sophia', 'Clark', '1982-09-22', '654 2nd Ave, New York, NY 10016', 'sophia.clark@example.com', '555-6789', 5, 7),
  (8, 'Lucas', 'Lopez', '1987-04-12', '321 1st Ave, New York, NY 10003', 'lucas.lopez@example.com', '555-0123', 5, 8);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [40]:
%%sql
INSERT INTO departments (department_id, department_name)
VALUES
  (1, 'Sales'),
  (2, 'Marketing'),
  (3, 'Finance'),
  (4, 'Human Resources'),
  (5, 'Information Technology');

*  sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: departments.department_id
[SQL: INSERT INTO departments (department_id, department_name)
VALUES
  (1, 'Sales'),
  (2, 'Marketing'),
  (3, 'Finance'),
  (4, 'Human Resources'),
  (5, 'Information Technology');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [41]:
%%sql
INSERT INTO job_titles (job_title_id, job_title)
VALUES
  (1, 'Sales Representative'),
  (2, 'Sales Manager'),
  (3, 'Marketing Coordinator'),
  (4, 'Marketing Manager'),
  (5, 'Financial Analyst'),
  (6, 'Human Resources Generalist'),
  (7, 'IT Specialist'),
  (8, 'IT Manager');

*  sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: job_titles.job_title_id
[SQL: INSERT INTO job_titles (job_title_id, job_title)
VALUES
  (1, 'Sales Representative'),
  (2, 'Sales Manager'),
  (3, 'Marketing Coordinator'),
  (4, 'Marketing Manager'),
  (5, 'Financial Analyst'),
  (6, 'Human Resources Generalist'),
  (7, 'IT Specialist'),
  (8, 'IT Manager');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [42]:
%%sql
INSERT INTO salaries (salary_id, employee_id, salary, start_date, end_date)
VALUES
  (1, 1, 80000.00, '2012-01-01', '2022-12-31'),
  (2, 2, 90000.00, '2017-04-01', '2022-12-31'),
  (3, 3, 100000.00, '2015-07-01', '2022-12-31'),
  (4, 4, 110000.00, '2009-02-01', '2022-12-31'),
  (5, 5, 120000.00, '2007-09-01', '2022-12-31'),
  (6, 6, 100000.00, '2020-11-01', '2022-12-31'),
  (7, 7, 110000.00, '2023-03-01', '2022-12-31'),
  (8, 8, 120000.00, '2011-04-01', '2022-12-31');

*  sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: salaries.salary_id
[SQL: INSERT INTO salaries (salary_id, employee_id, salary, start_date, end_date)
VALUES
  (1, 1, 80000.00, '2012-01-01', '2022-12-31'),
  (2, 2, 90000.00, '2017-04-01', '2022-12-31'),
  (3, 3, 100000.00, '2015-07-01', '2022-12-31'),
  (4, 4, 110000.00, '2009-02-01', '2022-12-31'),
  (5, 5, 120000.00, '2007-09-01', '2022-12-31'),
  (6, 6, 100000.00, '2020-11-01', '2022-12-31'),
  (7, 7, 110000.00, '2023-03-01', '2022-12-31'),
  (8, 8, 120000.00, '2011-04-01', '2022-12-31');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

## Querying data

In [43]:
%%sql
-- Load all employees

SELECT * FROM employees
LIMIT 5

*  sqlite://
Done.

[(1, 'Emily', 'Garcia', '1990-05-01', '123 Broadway, New York, NY 10001', 'emily.garcia@example.com', '555-1234', 1, 1),
 (2, 'Daniel', 'Nguyen', '1988-12-15', '456 Lexington Ave, New York, NY 10017', 'daniel.nguyen@example.com', '555-5678', 1, 2),
 (3, 'Brianna', 'Patel', '1985-03-25', '789 Madison Ave, New York, NY 10021', 'brianna.patel@example.com', '555-9012', 2, 3),
 (4, 'Aiden', 'Smith', '1993-07-07', '321 5th Ave, New York, NY 10016', 'aiden.smith@example.com', '555-3456', 2, 4),
 (5, 'Olivia', 'Brown', '1980-11-18', '654 8th Ave, New York, NY 10036', 'olivia.brown@example.com', '555-7890', 3, 5)]

In [44]:
%%sql
-- Show all employees, their job title and corresponding department

SELECT employees.first_name, employees.last_name, job_titles.job_title, departments.department_name
FROM employees
LEFT JOIN job_titles ON employees.job_title_id = job_titles.job_title_id
LEFT JOIN departments ON employees.department_id = departments.department_id;

*  sqlite://
Done.

[('Emily', 'Garcia', 'Sales Representative', 'Sales'),
 ('Daniel', 'Nguyen', 'Sales Manager', 'Sales'),
 ('Brianna', 'Patel', 'Marketing Coordinator', 'Marketing'),
 ('Aiden', 'Smith', 'Marketing Manager', 'Marketing'),
 ('Olivia', 'Brown', 'Financial Analyst', 'Finance'),
 ('Ethan', 'Carter', 'Human Resources Generalist', 'Human Resources'),
 ('Sophia', 'Clark', 'IT Specialist', 'Information Technology'),
 ('Lucas', 'Lopez', 'IT Manager', 'Information Technology')]

In [45]:
%%sql
-- List all employees who were born before 1990

SELECT employees.first_name, employees.last_name, employees.date_of_birth, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.department_id
WHERE employees.date_of_birth < '1990-01-01';

*  sqlite://
Done.

[('Daniel', 'Nguyen', '1988-12-15', 'Sales'),
 ('Brianna', 'Patel', '1985-03-25', 'Marketing'),
 ('Olivia', 'Brown', '1980-11-18', 'Finance'),
 ('Sophia', 'Clark', '1982-09-22', 'Information Technology'),
 ('Lucas', 'Lopez', '1987-04-12', 'Information Technology')]

In [46]:
%%sql
-- List all employees who were born after 1990 and currently work in Marketing

SELECT employees.first_name, employees.last_name, employees.date_of_birth, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.department_id
WHERE employees.date_of_birth > '1990-01-01' AND departments.department_name = 'Marketing';

*  sqlite://
Done.

[('Aiden', 'Smith', '1993-07-07', 'Marketing')]

In [47]:
%%sql
-- List the number of employees by department

SELECT departments.department_name, COUNT(employees.department_id) AS employee_count 
FROM departments 
LEFT JOIN employees ON departments.department_id = employees.department_id 
GROUP BY departments.department_id;

*  sqlite://
Done.

[('Sales', 2),
 ('Marketing', 2),
 ('Finance', 1),
 ('Human Resources', 1),
 ('Information Technology', 2)]

In [48]:
%%sql
-- List the average salary by job title

SELECT job_titles.job_title, AVG(salaries.salary) AS average_salary 
FROM employees 
JOIN salaries ON employees.employee_id = salaries.employee_id 
JOIN job_titles ON employees.job_title_id = job_titles.job_title_id 
GROUP BY job_titles.job_title_id;

*  sqlite://
Done.

[('Sales Representative', 80000.0),
 ('Sales Manager', 90000.0),
 ('Marketing Coordinator', 100000.0),
 ('Marketing Manager', 110000.0),
 ('Financial Analyst', 120000.0),
 ('Human Resources Generalist', 100000.0),
 ('IT Specialist', 110000.0),
 ('IT Manager', 120000.0)]

In [49]:
%%sql
-- List employees who make more than $100,000/yr by displaying their full name and email
--- Note: I prefer using 'CONCAT' but the ipython-sql library has limited access to the full SQL operators

SELECT first_name || ' ' || last_name AS full_name, email_address 
FROM employees 
JOIN salaries ON employees.employee_id = salaries.employee_id 
WHERE salaries.salary > 100000;

*  sqlite://
Done.

[('Aiden Smith', 'aiden.smith@example.com'),
 ('Olivia Brown', 'olivia.brown@example.com'),
 ('Sophia Clark', 'sophia.clark@example.com'),
 ('Lucas Lopez', 'lucas.lopez@example.com')]